In [1]:
import pandas as pd

In [2]:
data = {"id": [1001,1002,1003,1003],
       "cant": [30, None, 25, 200],
       "precio": [20.6, None, None, 43.6]}
df = pd.DataFrame(data)

In [3]:
df

     id   cant  precio
0  1001   30.0    20.6
1  1002    NaN     NaN
2  1003   25.0     NaN
3  1003  200.0    43.6

In [4]:
df_eliminados = df.dropna()

In [5]:
df.isnull().sum()

id        0
cant      1
precio    2
dtype: int64

In [6]:
df_eliminados

     id   cant  precio
0  1001   30.0    20.6
3  1003  200.0    43.6

In [7]:
valores = {"cant": 0, "precio": df["precio"].mean()}
df_ceros = df.fillna(valores)

In [8]:
df_ceros

     id   cant  precio
0  1001   30.0    20.6
1  1002    0.0    32.1
2  1003   25.0    32.1
3  1003  200.0    43.6

In [9]:
df_ceros["cant"] = df_ceros["cant"].astype(int)
df_ceros

     id  cant  precio
0  1001    30    20.6
1  1002     0    32.1
2  1003    25    32.1
3  1003   200    43.6

In [10]:
df_unicos = df_ceros.drop_duplicates(subset="id")
df_unicos

     id  cant  precio
0  1001    30    20.6
1  1002     0    32.1
2  1003    25    32.1

In [11]:
#Ejercicio 1:

In [12]:
data2 = {
    'ID': [1, 2, 3, 4, 5],
    'Producto': ['Producto A', 'Producto B', None, 'Producto D', 'Producto E'],
    'Cantidad': [10, 20, 30, None, 50],
    'Precio': [100, 200, 300, 400, None]
}

In [13]:
df2 = pd.DataFrame(data2)

In [14]:
df2

   ID    Producto  Cantidad  Precio
0   1  Producto A      10.0   100.0
1   2  Producto B      20.0   200.0
2   3        None      30.0   300.0
3   4  Producto D       NaN   400.0
4   5  Producto E      50.0     NaN

In [16]:
df2_rp = df2.fillna({"Cantidad": 40, "Precio": 500})

In [17]:
df2_rp

   ID    Producto  Cantidad  Precio
0   1  Producto A      10.0   100.0
1   2  Producto B      20.0   200.0
2   3        None      30.0   300.0
3   4  Producto D      40.0   400.0
4   5  Producto E      50.0   500.0

In [18]:
# Ejercicio 2

In [19]:
data3 = {
    'ID': [1, 2, 3, 4, 1],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D', 'Producto A'],
    'Cantidad': [10, 20, 30, 40, 50],
    'Precio': [100, 200, 300, 400, 100]
}

In [20]:
df3 = pd.DataFrame(data3)

In [22]:
df3

   ID    Producto  Cantidad  Precio
0   1  Producto A        10     100
1   2  Producto B        20     200
2   3  Producto C        30     300
3   4  Producto D        40     400
4   1  Producto A        50     100

In [31]:
df3_noduplic = df3.drop_duplicates(subset="Producto")

In [32]:
df3_noduplic

   ID    Producto  Cantidad  Precio
0   1  Producto A        10     100
1   2  Producto B        20     200
2   3  Producto C        30     300
3   4  Producto D        40     400

In [33]:
# Ejercicio 3

In [34]:
data4 = {
    'ID': [1, 2, 3, 4],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D'],
    'Cantidad': [10, 20, 30, 40],
    'Precio': [100, None, 300, None]
}

In [35]:
df4 = pd.DataFrame(data4)

In [36]:
df4

   ID    Producto  Cantidad  Precio
0   1  Producto A        10   100.0
1   2  Producto B        20     NaN
2   3  Producto C        30   300.0
3   4  Producto D        40     NaN

In [ ]:
df4_nonna =